// Вставить пропущенные логические операторы
//  var a = ""; var b = 7; var c = null; var d = 2; var e; alert( a c 
//     /*ЛО */ b d ); // 2 alert( e /*ЛО */ c && b /*ЛО */ d ); // null alert( e /*ЛО */ c /*ЛО */ b /*ЛО */ e /*ЛО */ d); // 7 ЛО - логический оператор

var a = "";
var b = 7;
var c = null;
var d = 2;
var e;

alert(a || c && b || d); //2 - в парі (c && b) повернеться с, а потім ЛО "або" шукає перше правдиве значення, а це d
alert( e || c && b && d); //null - виконуються спочатку &&, повертається перше хибне значення (с), і не доходять до b та d, до у тим паче через нижчий пріоритет "або"
alert( e || c || b || e || d); //7 - бо b-це перше правдиве значення
